app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
    def index
        @posts = Post.all

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "は"], ["content", "ああ"], ["created_at", "2023-11-13 13:39:58.196670"], ["updated_at", "2023-11-13 13:39:58.196670"]]
---
    def create
        @post = Post.new(post_params)

        if @post.save

UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2023-11-13 13:40:20.726614"], ["id", 2]]
---
    def update
        @post = Post.find(params[:id])
        if @post.update(post_params)