app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "guest"], ["LIMIT", 1]]
---
  def create
    user = User.find_by_name(params[:name])