app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "guest"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "guest"], ["password_digest", "[FILTERED]"], ["created_at", "2023-11-15 01:14:08.310344"], ["updated_at", "2023-11-15 01:14:08.310344"]]
---
  def create
    existing_user = User.find_by_name(params[:user][:name])

    if existing_user
      flash[:notice] = " "
      render :new
    else
      user = User.new(user_params)

      if user.save